<template>
        <v-carousel hide-delimiters :interval="8000" height="600">
            <v-carousel-item
                    v-for="(item,index) in items"
                    :key="index"
                    :src="item.src"
            >

                <!--<v-img-->
                        <!--:src="item.src"-->
                <!--&gt;</v-img>-->
                <v-layout align-end justify-start row fill-height>
                <v-card max-height  max-width
                >
                    <v-card-title primary-title>
                        <div>
                            <h3 class="headline mb-0">{{item.title}}</h3>
                        </div>
                        <v-card-actions>
                            <v-btn flat color="orange" v-if=item.download  @click="back(item.title, item.dsc, item.link)">Подробнее</v-btn>
                            <!--<v-btn flat v-if=item.download color="orange" @click="back(item.link_price)">Скачать прайс</v-btn>-->
                        </v-card-actions>
                    </v-card-title>
                </v-card>
                </v-layout>
            </v-carousel-item>
        </v-carousel>
</template>

<script>
    export default {
        name: "carousels",
        data () {
            return {
                items: [
                    {
                        src: 'https://sdelanounas.ru/i/d/3/d/d3d3LnNkZWxhbm91bmFzLnJ1L3VwbG9hZHMvNi81LzY1NjE0MjQzNzE4NjVfb3JpZy5qcGVnP19faWQ9NTcwMzE=.jpg',
                        title: "Завод \"Техстрой\" по производству труб",
                        avatar: 'http://www.polyplastic.ru/upload/production/menu/Mcline_water.jpg',
                        download:false
                    },
                    {
                        src: 'http://optimapipe.ru/images/w689-h345/20180627/3a0456431aaac0aec313168ebc606ed7.jpg',
                        title:"Многослойные трубы \"МультиТех\"",
                        download:true,
                        dsc: '<p>Завод "Техстрой" производит многослойные трубы «МультиТех» с соэкструзионными слоями диаметром 110-400 мм (*запланирован пуск в 2019 г. до 800 мм.). Мы предлагаем двухслойные трубы МультиТех II и трёхслойные трубы МультиТех III. Сырьё, из которого изготовляются трубы, это композиции полиэтилена ПЭ100 и ПЭ100RC (устойчивого к образованию и распространению трещин полиэтилена PE100RC (Resistance to Crack)).&nbsp;<br /> Трубы соответствуют требованиям ГОСТ 18599.&nbsp;<br /> Трубы изготавливаются следующих типов:&nbsp;</p>\n' +
                        '<ul>\n' +
                        '<li>Труба многослойная с соэкструзионными слоями из РЕ100 с чёрным светостабилизирующим слоем и с белым внутренним слоем из неокрашенного полиэтилена PE100 - МультиТех Эко II;&nbsp;</li>\n' +
                        '<li>Труба многослойная с соэкструзионными тремя слоями: наружный и внутренний слой из PE100 чёрного цвета, средний слой PE100 белый – МультиТех Эко III;&nbsp;</li>\n' +
                        '<li>Труба двухслойная, изготавливаемая методом соэкструзии, с геометрическими размерами по ГОСТ 18599. Внутренний слой изготавливается из полиэтилена PE-100, а наружный слой – из полиэтилена PE100RC - МультиТех II (для транспортировки воды наружный цвет синий, для транспортировки газа – жёлтый);&nbsp;</li>\n' +
                        '<li>Трёхслойная труба с соэкструзионными слоями: внутренний изготовлен из полиэтилена PE100RC, средний слой – из полиэтилена чёрного цвета PE-100, а наружный слой – из полиэтилена PE100RC - «МультиТех» III (для транспортировки воды наружный цвет синий, для газа - жёлтый).&nbsp;</li>\n' +
                        '</ul>\n' +
                        '<p>Многослойные трубы «МультиТех» предназначены для использования в строительстве подземных напорных трубопроводов, обеспечивающих хозяйственно-питьевое водоснабжение, а также для транспортировки газообразных веществ при температуре от 0 до +40°С. При этом возможно проведение укладки труб всех трёх типов с обратной засыпкой любым видом грунта, кроме валунного, с предварительным уплотнением дна траншеи. Трубы многослойные с содержанием слоя полиэтилена PE100RC с защитной оболочкой PROSAFE рекомендуются для использования при прокладке и реконструкции трубопроводов методами бестраншейных технологий (горизонтально-направленное бурение, релайнинг, замена изношенного трубопровода с его разрушением и т.п.).</p>\n',
                        link: 'multiteh',
                        link_price:'Truba_Multitekh.pdf'
                    },
                    {
                        src: 'https://www.calc.ru/imgs/articles3/15/04/68857256fef30289d393.76730355.jpg',
                        title:"Гофрированная труба",
                        download:true,
                        link_price:'Truba_gofr_bez_NDS.pdf',
                        dsc:'<p>Гофрированные трубы «Техстрой» из полипропилена или полиэтилена с двухслойной стенкой, изготовленные методом соэкструзии двух стенок. Продукция имеет наружный гофрированный (профилированный) слой и гладкий внутренний слой. «СибТрейд» – одна из первых компаний в России, использующая инновационный метод формирования раструба, разработанный компанией IPM (Италия). Данный метод предполагает формирование раструба методом литья под давлением, т.е. без сварного шва.</p>\n' +
                        '<p>Производитель безнапорной двухстенной гофрированной канализационной трубы завод «Техстрой» поставляет качественную продукцию для бытовых и общественных систем канализации. Продукция от нашего предприятия обладает сертификатами соответствия и необходимыми разрешительными документами. Звоните&nbsp;по телефону +7 (3952) 45-50-60, и мы поможем вам подобрать трубы гофрированные для канализации. Размеры и цены уточняйте у наших менеджеров.</p>\n' +
                        '<h2 style=" background: none; margin: 0px 0px 0px 0px;">Двухстенная труба гофрированная ПП – преимущества использования</h2>\n' +
                        '<p>Трубы гофрированные для безнапорной бытовой и ливневой канализации от компании «СибТрейд» обладают высокими эксплуатационными показателями и рядом других преимуществ:</p>\n' +
                        '<ul>\n' +
                        '<li>монтаж осуществляется быстро и без применения спецтехники и квалифицированных кадров;</li>\n' +
                        '<li>продукция обладает небольшой массой при повышенной кольцевой жёсткости (SN 12, SN 16) что снижает финансовые затраты на транспортировку и монтаж;</li>\n' +
                        '<li>устойчивость к коррозии, химически агрессивным веществам, гидроабразивному изнашиванию обеспечивает целостность трубопровода в любых условиях эксплуатации;</li>\n' +
                        '<li>полипропиленовые трубы для канализации (гофра) способны выдерживать температуры до 100ºС;</li>\n' +
                        '<li>устойчивость к низким температурным режимам обеспечивает герметичность трубопровода даже при многоразовом замерзании жидкости;</li>\n' +
                        '<li>хорошая пропускная способность обеспечивает необходимую скорость потока, благодаря чему можно не рыть глубоких уклонов;</li>\n' +
                        '<li>легко соединяется как с пластиковыми, так и с железобетонными колодцами разных типов;</li>\n' +
                        '<li>легко ремонтируются и быстро демонтируются;</li>\n' +
                        '<li>за счёт эластичности материала защищает трубопровод от повреждений при смещении или просадке грунта;</li>\n' +
                        '<li>при нормальных условиях период эксплуатации достигает 50 лет.</li>\n' +
                        '</ul>\n' +
                        '<h2 style=" background: none; margin: 0px 0px 0px 0px;">«СибТрейд» – надёжный поставщик</h2>\n' +
                        '<p>Высокое качество продукции «СибТрейд» обеспечивают следующие факторы:</p>\n' +
                        '<ul>\n' +
                        '<li>производство осуществляется на автоматизированном европейском оборудовании, которое гарантирует строгий контроль технологических процессов и параметров;</li>\n' +
                        '<li>на предприятии работает только персонал высокой квалификации;</li>\n' +
                        '<li>в качестве исходного сырья применяется продукция надёжных изготовителей;</li>\n' +
                        '<li>продукция проходит многоэтапный контроль качества.</li>\n' +
                        '</ul>\n' +
                        '<h2 style=" background: none; margin: 0px 0px 0px 0px;">Преимущества перед аналогами других производителей:</h2>\n' +
                        '<ul>\n' +
                        '<li>стабильность профиля гофры, обладающего высокой геометрической жёсткостью, и применение высокопрочных полимеров придаёт изделию повышенную кольцевую жёсткость в целом: SN 12, SN 16 - полипропилен;</li>\n' +
                        '<li>соединительные стыки уплотняются литым кольцом из этилен-пропиленового каучука с индивидуально разработанной формой. Это гарантирует герметичность и стойкость к агрессивным средам, в том числе к нефтепродуктам;</li>\n' +
                        '<li>гофрированная канализационная труба и раструбы от «СибТрейд» выдерживают недолговременные повышения давления до 0,25 МПа;</li>\n' +
                        '<li>благодаря уникальной конструкции монолитного с трубой раструба, который обладает удлиненной формой и специальными рёбрами жёсткости (SN 16), уменьшается риск его повреждения при транспортировке, хранении или монтаже;</li>\n' +
                        '<li>завод «Техстрой» первой в РФ применила передовой способ создания раструба по итальянской технологии: когда раструб формируется на гофре методом литья под давлением. Такой метод обеспечивает высокую надёжность муфтового соединения, повышенную прочность без утолщения стенок и сохранение герметичности даже при грунтовых подвижках.</li>\n' +
                        '</ul>',
                        link: 'gofrirovany_truby'
                    },
                    {
                        src: 'http://optimapipe.ru/images/w689-h345/20150605/dd5d954f27e4a37754bbb83a4fb3a0e5.JPG',
                        title: "ТРУБЫ PROSAFE",
                        download:true,
                        link_price:'Truba_voda_PE100_prosafe.pdf',
                        dsc: '<p>Компания «Сибтрейд» предлагает качественные трубы ПНД PROSAFE. Благодаря специальной защитной оболочке они подходят для бестраншейной укладки и сохраняют целостность трубопровода в любых условиях.</p>\n' +
                        '\t<p>PROSAFE – труба из ПЭ, которая предназначена для транспортировки водных и других сред (за исключением горючих газов). Производство осуществляется по ГОСТ 18599-2001 (изменения 1, 2), ГОСТ Р 50838-2009, ТУ 2248-012-54432486-2013 и PAS 1075. Используется для укладки трубопроводов бестраншейным методом.</p>\n' +
                        '\t<h3>Полипропиленовое покрытие труб защищает от повреждений</h3>\n' +
                        '\t<p>Защитная оболочка для полиэтиленовых труб из минералонаполненного полипропилена толщиной около 2 мм является уникальной разработкой технологов предприятия «Техстрой». Она обеспечивает повышенную устойчивость трубопровода к механическим повреждениям и позволяет выполнять укладку бестраншейным методом, что экономит затраты на строительство.</p>\n' +
                        '\t<p>При укладке бестраншейным способом трубопровод может повреждаться камнями или осколками. Это повышает риск глубинного разрыва и протечки в дальнейшем.</p>\n' +
                        '\t<p>Оболочка ПЭ трубы, обладающая стойкостью к локальным нагрузкам, защищает ее от контакта с повреждающими элементами и сохраняет целостность трубопровода при любых условиях монтажа.</p>\n' +
                        '\t<p>Даже если в процессе укладки, перевозки или использования возникнут трещины и другие повреждения на защитном покрытии, они не затронут основную напорную трубу, поскольку между ней и оболочкой присутствует малое сцепление.</p>\n' +
                        '\t<h3>Преимущества труб PROSAFE® с защитным покрытием</h3>Трубы PROSAFE® обладают всеми преимуществами труб из полиэтилена, при этом имеют следующие дополнительные преимущества:\n' +
                        '\t<ul>\n' +
                        '\t\t<li>Обеспечивают возможность траншейной укладки без песчаной засыпки, включая роторный метод (засыпка местным грунтом);</li>\n' +
                        '\t\t<li>Позволяют безопасно применять их при горизонтально направленном бурении, проколах, релайнинге, замене с разрушением ветхого трубопровода и при использовании иных бестраншейных технологий;</li>\n' +
                        '\t\t<li>Защитное покрытие значительно сглаживает пики напряжения на внутренней поверхности трубы, возникающие при воздействии неоднородностей засыпки;</li>\n' +
                        '\t\t<li>Защитное покрытие обеспечивает дополнительную прочность трубы в целом относительно воздействия внутреннего давления в трубопроводе;</li>\n' +
                        '\t\t<li>Увеличение срока службы трубопроводов до 100 лет;</li>\n' +
                        '\t\t<li>Значительное снижение расходов на строительство трубопроводов.</li>\n' +
                        '\t</ul>',
                        link: 'prosafe_gas'
                    },
                    {
                        src: 'https://www.germesgroup.com/Product/IMG_3694.jpg',
                        title: "Спиральновитые трубы",
                        download:true,
                        link_price:'Truba_SVT.pdf',
                        dsc: '<p>Спиральновитые полиэтиленовые трубы предлагает к поставке компания «СибТрейд». Продукция сопровождается сертификатами соответствия и другими разрешительными документами.</p>\n' +
                        '<p>Звоните, если вам нужна СВТ (спиральновитая труба). Купить изделие нужного диаметра и кольцевой жёсткости помогут менеджеры нашего завода.</p>\n' +
                        '<h2 style=" background: none; margin: 0px 0px 0px 0px;">Спиральновитая труба – производство «СибТрейд»</h2>\n' +
                        '<p>Спиральновитые трубы производитель «Техстрой» выпускает по ТУ&nbsp;2248-024-54432486-2016.</p>\n' +
                        '<p>Труба спиральновитая полиэтиленовая производится особым методом. В процессе изготовления полый прямоугольный профиль навивается на вращающийся цилиндр, и одновременно экструдер сваривает витки профиля между собой.</p>\n' +
                        '<p>За счёт такой технологии производства повышается жёсткость изделия и его устойчивость к любым деформациям.</p>\n' +
                        '<h2 style=" background: none; margin: 0px 0px 0px 0px;">Спиральновитые трубы из полиэтилена: характеристики</h2>\n' +
                        '<p>Труба «Техстрой СВТ» обладает номинальными внутренними диаметрами в диапазоне от 1200 мм до 2600 мм. Она способна транспортировать в безнапорной системе жидкие среды температурой до +45°С, и может выдерживать непродолжительные повышения температуры до +80˚С. Эффективно применение данных изделий для реконструкции повреждённых и ветхих трубопроводных систем методом санации. При этом не требуется остановка водостоков.</p>\n' +
                        '<p>Длина изделий зависит от потребностей и пожеланий клиента и ограничена исключительно удобством транспортировки. От номинального значения показатель длины может отклоняться не более чем на 1%.</p>\n' +
                        '<p>К заказу доступны изделия с показателями жёсткости от SN2 до SN16, которые отличаются толщиной стенки.</p>\n' +
                        '<h2 style=" background: none; margin: 0px 0px 0px 0px;">СВТ – трубы с гладкими и винтовыми окончаниями на выбор клиента&nbsp;</h2>\n' +
                        '<p>На выбор заказчика «СибТрейд» может произвести спиральновитые трубы под разные способы стыкования.</p>\n' +
                        '<p>Если предполагается использовать методы соединения с помощью муфты, бандажа с резиновым уплотнителем или экструзионного стыкования, то следует выбирать изделия с гладкими окончаниями.</p>\n' +
                        '<p>Если заказчик планирует свинчивать изделия между собой с последующей герметизацией стыков (только экструзией либо экструзией и термоусаживающей лентой), в этом случае подойдут спиральновитые трубы с резьбой.</p>',
                        link: 'spiralevid_truby'
                    },
                    {
                        src: 'http://www.sibkomplekt.org/sites/default/files/fitingi_elektrosvarnye_0.jpg',
                        title: "Фитинги и запорная арматура",
                        download:false,
                        link_price:''
                    },
                    {
                        src: 'http://p154.ru/images/protect-catalog-1024x1024_1/item/i3vul3bomm.jpg',
                        title: "Трубы Техстрой TR",
                        download:false,
                        link_price:'PE-RT_20183.pdf'
                    }
                ]
            }
        },
        methods: {
            back(title,dsc,link){
                this.$vuetify.goTo(0);
                console.log(link);
                if(dsc){
                    this.$router.push({ name: 'post', params: {title:title, dsc, link:link} });
                    // this.$router.replace({path: 'post/'+c, props: {src, c, dsc}});
                    // this.$router.replace({path: '/post/'+c+'/'+dsc, component: More,  query: { plan: 'private' }});
                }else if(link){
                    this.$router.push({ name: link});
                }else {
                    // this.$router.replace({ name: 'home'});

                }
                // if(v!='') {
                //     // var pdf = location.protocol + "//" + location.host+'/static/' + v;
                //     // window.open(pdf);
                // }
            }
        }
    }
</script>

<style scoped>

</style>