<template>
    <v-container text-md-center>
    <v-layout>
        <v-flex xs12>
            <v-tabs
                    slider-color="orange">
                <v-tab>
                    Полимерные трубы
                </v-tab>
                <v-tab-item>
                    <v-timeline>
                        <v-timeline-item
                                v-for="(item,index) in items"
                                :key="index"
                                large
                        >
                            <v-avatar slot="icon">
                                <img :src="item.avatar">
                            </v-avatar>
                            <span slot="opposite">
            <v-card-text v-if="item.oposit_text" v-html="item.oposit_text">
            </v-card-text>
            <v-card v-else>
            <v-img
                    :src="srcPath+item.link+'.jpg'"
                    aspect-ratio="2.75"
            ></v-img>
            </v-card>
            </span>
                            <v-card class="elevation-2">
                                <v-card-title class="headline">{{item.title}}</v-card-title>
                                <v-card-text>
                                    {{item.dsc}}
                                </v-card-text>
                            </v-card>
                        </v-timeline-item>
                    </v-timeline>
                </v-tab-item>
                <v-tab>
                    Аппарат для сварки полиэтиленовых труб
                </v-tab>
                <v-tab-item>
                    <v-timeline>
                        <v-timeline-item
                                v-for="(item,index) in items2"
                                :key="index"
                                large
                        >
                            <v-avatar slot="icon">
                                <img :src="item.avatar">
                            </v-avatar>
                            <span slot="opposite">
            <v-card-text v-if="item.oposit_text" v-html="item.oposit_text">
            </v-card-text>
            <v-card v-else>
            <v-img
                    :src="srcPath+item.link+'.jpg'"
                    aspect-ratio="2.75"
            ></v-img>
            </v-card>
            </span>
                            <v-card class="elevation-2">
                                <v-card-title class="headline">{{item.title}}</v-card-title>
                                <v-card-text>
                                    {{item.dsc}}
                                </v-card-text>
                            </v-card>
                        </v-timeline-item>
                    </v-timeline>


                </v-tab-item>
                <v-tab>
                    Фитинги полиэтиленовые и комплектующие
                </v-tab>
                <v-tab-item>
                    <v-timeline>
                        <v-timeline-item
                                v-for="(item,index) in items3"
                                :key="index"
                                large
                        >
                            <v-avatar slot="icon">
                                <img :src="item.avatar">
                            </v-avatar>
                            <span slot="opposite">
            <v-card-text v-if="item.oposit_text" v-html="item.oposit_text">
            </v-card-text>
            <v-card v-else>
            <v-img
                    :src="srcPath+item.link+'.jpg'"
                    aspect-ratio="2.75"
            ></v-img>
            </v-card>
            </span>
                            <v-card class="elevation-2">
                                <v-card-title class="headline">{{item.title}}</v-card-title>
                                <v-card-text>
                                    {{item.dsc}}
                                </v-card-text>
                            </v-card>
                        </v-timeline-item>
                    </v-timeline>


                </v-tab-item>
                <v-tab>
                    Запорно-регулирующая арматура
                </v-tab>
                <v-tab-item>
                    <v-timeline>
                        <v-timeline-item
                                v-for="(item,index) in items4"
                                :key="index"
                                large
                        >
                            <v-avatar slot="icon">
                                <img :src="item.avatar">
                            </v-avatar>
                            <span slot="opposite">
            <v-card-text v-if="item.oposit_text" v-html="item.oposit_text">
            </v-card-text>
            <v-card v-else>
            <v-img
                    :src="srcPath+item.link+'.jpg'"
                    aspect-ratio="2.75"
            ></v-img>
            </v-card>
            </span>
                            <v-card class="elevation-2">
                                <v-card-title class="headline">{{item.title}}</v-card-title>
                                <v-card-text>
                                    {{item.dsc}}
                                </v-card-text>
                            </v-card>
                        </v-timeline-item>
                    </v-timeline>


                </v-tab-item>
                <v-tab>
                    Полиэтиленовые колодцы и резервуары
                </v-tab>
                <v-tab-item>
                    <v-timeline>
                        <v-timeline-item
                                v-for="(item,index) in items5"
                                :key="index"
                                large
                        >
                            <v-avatar slot="icon">
                                <img :src="item.avatar">
                            </v-avatar>
                            <span slot="opposite">
            <v-card-text v-if="item.oposit_text" v-html="item.oposit_text">
            </v-card-text>
            <v-card v-else>
            <v-img
                    :src="srcPath+item.link+'.jpg'"
                    aspect-ratio="2.75"
            ></v-img>
            </v-card>
            </span>
                            <v-card class="elevation-2">
                                <v-card-title class="headline">{{item.title}}</v-card-title>
                                <v-card-text>
                                    {{item.dsc}}
                                </v-card-text>
                            </v-card>
                        </v-timeline-item>
                    </v-timeline>


                </v-tab-item>
            </v-tabs>
        </v-flex>
    </v-layout>
    </v-container>
</template>

<script>
    export default {
        name: "NewProduct",
        data() {
            return {
                srcPath: location.protocol + "//" + location.host + '/static/img/',
                items: [
                    {
                        avatar: 'http://www.polyplastic.ru/upload/production/menu/gost_water.jpg',
                        title: 'Водоснабжение',
                        dsc: 'Предлагаем полиэтиленовые трубы для водоснабжения от производителя, выполненные из качественных полимерных материалов. ООО «СибТрейд» поставляет в разные регионы России современные трубы для водоснабжения из полиэтилена. В каталоге предприятия представлен большой выбор продукции для прокладки наружных сетей водоснабжения:\n' +
                        '\n' +
                        '- Диапазон диаметров от 20 мм до 1600 мм. - Для напорных сетей изготавливаются также трубы с защитным покрытием ПРОСЭЙФ (PROSAFE) ПЭ 100 с повышенной стойкостью к механическим повреждениям. Диапазон диаметров – от 110 до 800 мм, с рабочим давлением – до 25 атм. - Для сетей, которые прокладываются в условиях плотной городской застройки, «СибТрейд» рекомендует трубы из инновационного материала PE100 RC. Это сырье является разработкой зарубежных передовых нефтехимических производств и представляет собой полиэтилен с особыми свойствами, предотвращающими образование трещин. Срок службы трубопроводов для водоснабжения из PE100RC составляет до 100 лет. - "Техстрой" запустил инновационные полимерные многослойные напорные трубы МультиТЕХ II (двухслойные) и МультиТЕХ III (трёхслойные) для прокладки трубопроводов с различными свойствами в отношении переносимой среды и способов укладки. Например, для водоснабжения подойдёт сочетание различных слоёв ПЭ100 и ПЭ100RC. - Также возможно использование труб из ПЭ100 для прокладки безнапорных сетей.\n' +
                        '\n' +
                        'Звоните, и мы поможем подобрать лучшие водопроводные трубы с учётом решаемых задач.',
                        link: 'p_TV'
                    },
                    {
                        avatar: 'http://www.polyplastic.ru/upload/production/menu/gost_gas.jpg',
                        title: 'Газоснабжение',
                        dsc: 'Качество труб «СибТрейд» для газопроводов обусловлено полным соответствием ГОСТ Р 50838-2009.\n' +
                        '\n' +
                        'Обращайтесь к нам напрямую, и вас порадует выгодная цена трубы для газа.\n' +
                        '\n' +
                        'Газовая труба – надёжность как залог безопасности\n' +
                        '\n' +
                        'Полиэтиленовая труба для газа является одним из самых ответственных изделий, в производстве которого принципиально важное значение имеет строгое соблюдение технологии, применение высокопрочных качественных материалов и контроль на каждом этапе. Только при соблюдении данных факторов можно обеспечить безопасность трубопровода для людей и окружающей среды.\n' +
                        '\n' +
                        'Изготовление газовой трубы по ГОСТу\n' +
                        '\n' +
                        'Трубы для газа от производителя «Техстрой» изготавливаются в условиях завода, где применяется новейшее оборудование, осуществляется ежесекундный контроль всех технологических этапов и строго соблюдаются требования ГОСТ Р 50838-2009.\n' +
                        '\n' +
                        'Производство труб для газопроводов осуществляется с применением качественного полиэтилена марки ПЭ100, прочностные и эксплуатационные характеристики которого одобрены госстандартами для создания газовых сетей. По запросу Заказчика возможно изготовление газовых труб из ПЭ 80.\n' +
                        '\n' +
                        'Также, согласно нормам, каждая выпускаемая труба под газ получает маркировку жёлтыми полосами, что визуально демонстрирует возможность применения данных труб в сфере строительства газовых трубопроводов. Компания «СибТрейд» предлагает возможность изготовления трубы ПНД для газопроводов с защитным покрытием PROSAFE. Благодаря специальной защитной оболочке они подходят для бестраншейной укладки и сохраняют целостность трубопровода в любых условиях.\n' +
                        '\n' +
                        'PROSAFE – труба из ПЭ, которая предназначена для транспортировки водных и других сред (за исключением горючих газов). Производство осуществляется по ГОСТ 50838-2009. Используется для укладки трубопроводов бестраншейным методом',
                        link: 'p_TG'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/tovar3.png',
                        title: 'Канализация',
                        dsc: 'Гофрированные трубы «Техстрой» из полипропилена или полиэтилена с двухслойной стенкой, изготовленные методом соэкструзии двух стенок. Продукция имеет наружный гофрированный (профилированный) слой и гладкий внутренний слой. «СибТрейд» – одна из первых компаний в России, использующая инновационный метод формирования раструба, разработанный компанией IPM (Италия). Данный метод предполагает формирование раструба методом литья под давлением, т.е. без сварного шва.\n' +
                        '\n' +
                        'Производитель безнапорной двухстенной гофрированной канализационной трубы завод «Техстрой» поставляет качественную продукцию для бытовых и общественных систем канализации. Продукция от нашего предприятия обладает сертификатами соответствия и необходимыми разрешительными документами. Звоните по телефону 8 800 350 20 70, и мы поможем вам подобрать трубы гофрированные для канализации. Размеры и цены уточняйте у наших менеджеров.',
                        link: 'p_TK'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/drenazhlogo.png',
                        title: 'Дренаж',
                        dsc: 'Дренажные гофрированные трубы «Техстрой» из полипропилена и полиэтилена, изготовленные методом соэкструзии двух стенок. Продукция имеет наружный гофрированный (профилированный) слой и гладкий внутренний слой. «СибТрейд» – одна из первых компаний в России, использующая инновационный метод формирования раструба, разработанный компанией IPM (Италия). Данный метод предполагает формирование раструба методом литья под давлением, т.е. без сварного шва.\n' +
                        '\n' +
                        'Дренажные гофрированная труба ПП, поставляемая компанией «СибТрейд», изготавливается по ТУ 2248-011-54432486- 2013. В качестве сырья используются полипропиленовые материалы, а продукция может отличаться диаметром, классом жёсткости до SN16 и типами перфорации.',
                        link: 'drenajny_truby'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/tovar4.png',
                        title: 'С защитной оболочкой PROSAFE',
                        dsc: 'Компания «Сибтрейд» предлагает качественные трубы ПНД PROSAFE. Благодаря специальной защитной оболочке они подходят для бестраншейной укладки и сохраняют целостность трубопровода в любых условиях.\n' +
                        'PROSAFE – труба из ПЭ, которая предназначена для транспортировки водных и других сред (за исключением горючих газов). Производство осуществляется по ГОСТ 18599-2001 (изменения 1, 2), ГОСТ Р 50838-2009, ТУ 2248-012-54432486-2013 и PAS 1075. Используется для укладки трубопроводов бестраншейным методом.\n' +
                        'Полипропиленовое покрытие труб защищает от повреждений\n' +
                        'Защитная оболочка для полиэтиленовых труб из минералонаполненного полипропилена толщиной около 2 мм является уникальной разработкой технологов предприятия «Техстрой». Она обеспечивает повышенную устойчивость трубопровода к механическим повреждениям и позволяет выполнять укладку бестраншейным методом, что экономит затраты на строительство.\n' +
                        'При укладке бестраншейным способом трубопровод может повреждаться камнями или осколками. Это повышает риск глубинного разрыва и протечки в дальнейшем.\n' +
                        'Оболочка ПЭ трубы, обладающая стойкостью к локальным нагрузкам, защищает ее от контакта с повреждающими элементами и сохраняет целостность трубопровода при любых условиях монтажа.\n' +
                        'Даже если в процессе укладки, перевозки или использования возникнут трещины и другие повреждения на защитном покрытии, они не затронут основную напорную трубу, поскольку между ней и оболочкой присутствует малое сцепление.',
                        link: 'prosafe_gas'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/tovar5.png',
                        title: 'Теплоснабжение',
                        dsc: 'Трубы напорные ТЕХСТРОЙ TR из полиэтилена PE-RT тип II неизолированные выпускаются в соответствии с ТУ 2248-012-54432486-2013, в которых учтены требования ГОСТ Р 52134-2003.\n' +
                        'Трубы обеспечивают возможность строительства подземных напорных трубопроводов и трубопроводов, закрытых от воздействия ультрафиолетового излучения, обеспечивающих транспортирование воды, включая хозяйственно-питьевое водоснабжение, а также транспортировку других жидких и газообразных веществ при температуре от 0 до +95 °С, кроме горючих газов. Допускаются кратковременные (аварийные) подъёмы температуры среды до +110 °С.\n' +
                        'Полиэтиленовые напорные трубы и фитинги PE-RT для тёплого пола и отопления могут выпускаться номинальным наружным диаметром от 16 до 630 мм с SDR от 21 до 7,4. Трубы могут выпускаться красного цвета и чёрного цвета с красными маркировочными полосами (цвет наружной поверхности).\n' +
                        'Предусматривается выпуск труб типа ТЕХСТРОЙ TR1 PROSAFE - труб, наружная поверхность которых покрыта защитной оболочкой из термопластичного полимера, что значительно упрощает строительство трубопроводов: при укладке труб в траншеи не требуется специальная их подготовка и засыпка песком. Они могут быть использованы при применении бестраншейных технологий: горизонтально-направленное бурение, релайнинг и другие высокоэффективные методы прокладки трубопроводов.\n',
                        link: 'heat_insulation'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/tovar17.png',
                        title: 'Напорные ПВХ',
                        dsc: 'Характеристики напорных труб из нПВХ подразделяются на пять типов по номинальному давлению - 0,63; 0,8; 1,0; 1,25 и 1,6 МПа.\n' +
                        'Преимущества труб из непластифицированного поливинилхлорида (НПВХ):\n' +
                        'долговечность (срок эксплуатации 50 лет);\n' +
                        'долговечность соединений труб друг с другом;\n' +
                        'не подвержены адгезии;\n' +
                        'высокая герметичность (за счет резиновых уплотнительных колец);\n' +
                        'небольшой вес 1м трубы (облегчает транспортировку и монтаж);\n' +
                        'химическая стойкость;\n' +
                        'низкая шероховатость;\n' +
                        'высокая коррозионная устойчивость;\n' +
                        'высокая прочность (допустимое расчетное напряжение составляет 12,5 МПа);\n' +
                        'отсутствие склонности к растрескиванию;\n' +
                        'совершенные гидравлические свойства;\n' +
                        'способность образовывать вместе с окружающим грунтом единую систему, способную поглощать нагрузки;\n' +
                        'способность к самоочистке;\n' +
                        'исключены потери напора на трение.\n' +
                        'Одним из преимуществ из нПВХ является их быстрое соединение между собой – раструбное под уплотнительное кольцо.\n' +
                        'Данное преимущество позволяет проложить данный вид труб под землей без использования дополнительного оборудования. Выпускаются в отрезках по 6 м.',
                        link: 'npvh'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/truba-spiral-new.png',
                        title: 'Спиральновитая техстрой СВТ',
                        dsc: 'Спиральновитые полиэтиленовые трубы производит и предлагает к поставке предприятие «Техстрой». Продукция сопровождается сертификатами соответствия и другими разрешительными документами.\n' +
                        'Звоните, если вам нужна СВТ (спиральновитая труба). Купить изделие нужного диаметра и кольцевой жёсткости помогут менеджеры нашего завода.\n' +
                        'Спиральновитая труба – производство «Техстрой»\n' +
                        'Спиральновитые трубы производитель «Техстрой» выпускает по ТУ 2248-024-54432486-2016.\n' +
                        'Труба спиральновитая полиэтиленовая производится особым методом. В процессе изготовления полый прямоугольный профиль навивается на вращающийся цилиндр, и одновременно экструдер сваривает витки профиля между собой.\n' +
                        'За счёт такой технологии производства повышается жёсткость изделия и его устойчивость к любым деформациям.',
                        link: 'spiralevid_truby'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/TrubaMultiDex/multitehlogo.png',
                        title: 'Многослойные трубы Мультитех',
                        link: 'multiteh_gas',
                        dsc: 'Завод "Техстрой" производит многослойные трубы «МультиТех» с соэкструзионными слоями диаметром 110-400 мм (*запланирован пуск в 2019 г. до 800 мм.). Мы предлагаем двухслойные трубы МультиТех II и трёхслойные трубы МультиТех III. Сырьё, из которого изготовляются трубы, это композиции полиэтилена ПЭ100 и ПЭ100RC (устойчивого к образованию и распространению трещин полиэтилена PE100RC (Resistance to Crack)). \n' +
                        'Трубы соответствуют требованиям ГОСТ 18599. \n' +
                        'Трубы изготавливаются следующих типов: \n' +
                        'Труба многослойная с соэкструзионными слоями из РЕ100 с чёрным светостабилизирующим слоем и с белым внутренним слоем из неокрашенного полиэтилена PE100 - МультиТех Эко II; \n' +
                        'Труба многослойная с соэкструзионными тремя слоями: наружный и внутренний слой из PE100 чёрного цвета, средний слой PE100 белый – МультиТех Эко III; \n' +
                        'Труба двухслойная, изготавливаемая методом соэкструзии, с геометрическими размерами по ГОСТ 18599. Внутренний слой изготавливается из полиэтилена PE-100, а наружный слой – из полиэтилена PE100RC - МультиТех II (для транспортировки воды наружный цвет синий, для транспортировки газа – жёлтый); \n' +
                        'Трёхслойная труба с соэкструзионными слоями: внутренний изготовлен из полиэтилена PE100RC, средний слой – из полиэтилена чёрного цвета PE-100, а наружный слой – из полиэтилена PE100RC - «МультиТех» III (для транспортировки воды наружный цвет синий, для газа - жёлтый).',
                        link: 'multiteh'
                    }
                ],
                items2: [
                    {
                        avatar: 'http://tehstroi.ru/images/tovar31.png',
                        title: 'Аппараты для электромуфтовой сварки',
                        dsc: 'Предлагаем Вашему вниманию аппараты для электромуфтовой сварки производства Германия, Великобритания.\n' +
                        'Аппараты позволяют сваривать полиэтиленовые трубы при помощи муфт с закладным нагревательным элементом диаметром до 1600 мм.\n' +
                        'Сварочный аппарат Friamat Prime Eco\n' +
                        'Сварочный аппарат Пегас\n' +
                        'Сварочный аппарат Кентавр',
                        link: 'p_ES'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/tovar32.png',
                        title: 'Стыковые сварочные аппараты',
                        dsc: 'Сварочные аппараты для сварки полиэтиленовых труб применяются для выполнения работ различной сложности. У нас можно приобрести оборудование для сварки полиэтиленовых труб, качество которого отвечает международным стандартам, что подтверждено соответствующими сертификатами. В нашем ассортименте имеются сварочные машины для ПЭ труб для проведения сварочных работ на трубопроводах различных диаметров.\n' +
                        'Предлагаем вашему вниманию сварочные машины c гидравлическим приводом торговой марки «WELTECH», Турция.\n' +
                        'ООО «Техстрой» является эксклюзивным дистрибьютором «WELTECH» на территории Российской Федерации.\n' +
                        'Компактные, транспортабельные машины применяются в полевых условиях, на строительной площадке, в цеху и в стеснённых условиях для стыковой сварки полиэтиленовых труб и соединительных деталей диаметром от 40 мм до 1600 мм.\n' +
                        'Сварочные машины для полиэтиленовых труб поставляются как с электрогидравлическим приводом, так и с блоком протоколирования CNC.',
                        link: 'p_SS'
                    }
                ],
                items3: [
                    {
                        avatar: 'http://tehstroi.ru/images/tovar131.png',
                        title: 'Сегментные фитинги ПЭ',
                        dsc: 'Сегментные фитинги для полиэтиленовых труб применяются при проведении монтажных работ, связанных с обустройством полиэтиленовых трубопроводов различных диаметров и назначений.\n' +
                        'Также фитинги для полиэтиленовых труб именуются как фитинги для ПНД, что совершенно корректно, потому как производятся они из высокоплотных ПЭ-материалов низкого давления. Такие элементы могут использоваться в качестве составных частей современных трубопроводов, в системах водоснабжения частного и производственного характера.\n' +
                        'Благодаря своей высокой технологичности ПЭ-фитинги обеспечивают надёжное соединение в местах стыковки труб друг с другом, а также при использовании муфт, тройников, переходов, включая стыкование стального и полиэтиленового трубопроводов. Их применение позволяет решать задачи различной сложности на высоком техническом уровне, создавая трубопроводную сеть с большим эксплуатационным ресурсом.\n' +
                        'Фитинги мы изготавливаем по ТУ2248-004-54432486-2015 или эскизу заказчика методом стыковой сварки заготовок труб. Сварка труб методом встык — современный и малозатратный способ конструирования фасонных частей трубопроводов практически любой сложности. Сварные фитинги используются при монтаже трубопроводов, труб для канализации в местах поворотов, разветвлений, изменений диаметра трассы, присоединения трубопроводной арматуры и т. п.',
                        link: 'p_ST'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/tovar133.png',
                        title: 'Фитинги из гофрированных труб',
                        dsc: 'Качественные соединительные изделия для канализации и дренажных систем предлагает завод «Техстрой»! Реализуем только собственную продукцию! Звоните: 8 (395) 245-50-60, отгружаем быстро!\n' +
                        'Соединительные детали из гофрированных полипропиленовых и полиэтиленовых труб: преимущества конструкции\n' +
                        'Все виды соединительных конструкций изготавливаются на заводах «Техстрой» из высокоплотного полиэтилена и полипропилена. Изделия используются для прочного соединения безнапорных систем канализации и дренажа. Плотность прилегания достигается применением специальных резиновых прокладок, поставляемых отдельно. Конструкции снабжены элементами жёсткости, как и гофрированные трубы, и обладают строением, позволяющим создать оптимальное крепление двух отрезков труб.\n' +
                        'Для соединения трубопроводов без раструбов применяются специальные муфты.\n' +
                        'Обратившись в «Техстрой», вы найдете следующие изделия:\n' +
                        'Отводы, тройники, крестовины;\n' +
                        'Муфты для прохода через железобетонные колодцы;\n' +
                        'Муфты соединительные с удобным упором, полумуфты;\n' +
                        'Резиновые прокладки, обеспечивающие герметичное и плотное соединение.',
                        link: 'p_GF'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/lityefitingilogo.png',
                        title: 'Литые фитинги',
                        dsc: 'Соединение труб ПНД в трубопровод, особенно требовательных к давлению в системе, невозможно представить без литых фитингов. Они изготавливаются из того же материала, что и вся остальная система, - полиэтилен.\n' +
                        'Литые фитинги применяются при создании:\n' +
                        'водопроводных систем технического и питьевого назначения;\n' +
                        'систем орошения;\n' +
                        'газопроводов.\n' +
                        'Фасонные изделия для полиэтиленовых труб, произведённые методом литья полиэтилена под давлением, выпускаются ООО «Техстрой» в различном диапазоне диаметров и толщины стенки, что позволяет создавать трубопровод любой направленности и разветвлённости. Литые фитинги позволяют присоединить трубопровод к стальным трубопроводам и запорной арматуре.\n' +
                        'Завод «Техстрой» имеет возможность укомплектовать инженерные сети соединительными деталями. Ассортимент литых фитингов – редукционные тройники, заглушки, короткие и удлинённые переходы, отводы, втулки и др., – решит задачи любой сложности. Мы предлагаем фитинги различных параметров для систем газо- и водоснабжения.\n' +
                        'Наши фитинги проходят входной контроль и испытания в условиях лаборатории нашего предприятия.',
                        link: 'p_MF'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/tovar135.png',
                        title: 'Электросварные фитинги',
                        dsc: 'Ассортимент изделий включает муфты, диаметром от 20 до 1200 мм (муфта электросварная ПЭ 100 SDR 11), фасонные изделия различных типов (отвод, муфта переходная), седловые отводы, запорную арматуру и вентили для врезки под давлением, шаровые краны из ПЭ, переходные элементы металл/ПЭ, специальные изделия для реконструкции и ремонта трубопроводов из ПЭ.\n' +
                        'Изделия отличаются высочайшими техническими характеристиками и являются эталоном по параметрам качества изготовления, надёжности и долговечности сварных соединений.\n' +
                        'С помощью изделий можно организовать газораспределительную сеть (газопровод), водоотвод, канализационную сеть и другие виды сетей, выполнить беспрецедентно надёжный монтаж газовых труб.\n' +
                        'Теперь в номенклатуре муфты для газопроводов SDR 9 и клапан безопасности расхода газа (газ стоп). Изделия соответствуют требованиям нового СП 62.13330.2011, актуализированный СНиП 42-01.',
                        link: 'p_EF'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/tovar136.jpg',
                        title: 'Технологические заглушки',
                        dsc: 'ООО «Техстрой» является производителем технологических заглушек (колпаков) для полимерных трубопроводов.\n' +
                        'Предназначение заглушек:\n' +
                        'а) для предотвращения повреждений торцов сварных труб малого и среднего диаметров, деталей полимерных трубопроводов при транспортировке, складировании и хранении.\n' +
                        'б) для обеспечения защиты от попадания вовнутрь атмосферных осадков, грязи, инородных тел.\n' +
                        'Сфера применения:\n' +
                        '— производители, потребители, транспортные компании, связанные с полимерными трубами (хранение, транспортировка, экспорт). Предлагаемые заглушки производства «Техстрой» обеспечивают сохранение технических и технологических свойств при температурных режимах от – 50º С до + 80º С. Используемые полимерные материалы не содержат токсичных компонентов, веществ способных вызвать коррозию, а также слипание поверхности.',
                        link: 'p_ZZ'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/ncpc/ncpc-logo.png',
                        title: 'НСПС',
                        dsc: 'Переход полиэтилен – сталь или НСПС (Неразъёмное Соединение Полиэтилен Сталь) Используется для соединения металлических и полиэтиленовых труб. Востребованыпри замене устаревших участков металлических труб на полиэтиленовые. Применяются при монтаже водоснабжения, газоснабжения или напорной канализации. В зависимости от марки полиэтилена подразделяются на НСПС для холодных и горячих сред. Изделие представляет собой герметично соединённые в заводских условиях отрезки металлической и полиэтиленовой труб. Усиление шва обеспечивается использованием специальной муфты. Широкий ассортимент диаметров, доступность по цене, делают данное изделие незаменимым при строительстве и ремонте наружных сетей. Более подробную информацию вы можете получить при обращении к специалистам завода Техстрой.',
                        link: 'p_NSPS'
                    },
                ],
                items4: [
                    {
                        avatar: 'http://tehstroi.ru/images/tovar41.png',
                        title: 'Задвижки с обрезиненым клином',
                        dsc: 'Дизайну клиновых задвижек характерна надёжность до мельчайших деталей.\n' +
                        'Клин полностью вулканизирован резиной EPDM состав которой утверждён для контакта с питьевой водой. Клин имеет исключительную износостойкость благодаря свойству резины восстанавливать свою первоначальную форму, процессу обрезинивания сердечника двойной адгезией слоя и своей прочной конструкции. Надёжность системы уплотнения штока, состоящей из 4-х частей, высокая прочность штока и полная антикоррозийная защита обеспечивают непревзойдённую надёжность задвижки.\n' +
                        'Номенклатурный каталог компании включает в себя широкий ассортимент задвижек для газа, пожаротушении с различными способами присоединения.\n' +
                        'Задвижки производства Metalpol, Польша, тип 111 UG, с обрезиненным клином применяются как запорное устройство на трубопроводах для холодной и горячей воды и системах канализации. Благодаря обрезиненной конструкции клина задвижки обладают высокой герметичностью (Класс «А»). Конструкция с невыдвижным шпинделем имеет более компактные размеры, что облегчает установку чугунных задвижек с обрезиненным клином в условиях ограниченных пространств. Задвижка предназначена для закрывания и открывания потока жидкости. Могут устанавливаться в подземных и надземных трубопроводах (горизонтально и вертикально).',
                        link: 'p_ZK'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/phocagallery/Zap-Reg-Armatura/1.png',
                        title: 'Ножевые/шиберные задвижки',
                        dsc: 'Задвижка шиберная ножевая с невыдвижным и выдвижным штоком и штурвалом, со сменным верхним сальником.\n' +
                        'Шиберные ножевые задвижки с фланцевым/межфланцевым присоединением являются двунаправленными с гладкостенным и полным проходом. Защищённые уплотнения и материалы высокого класса обеспечивают отличные эксплуатационные характеристики и длительный срок службы. Задвижки можно налаживать во время их работы. Варианты поставки: с рычагом, выдвижным штоком и штурвалом или с невыдвижным штоком и штурвалом, с пневматическим приводом, с фланцем ISO для установки привода или вместе с электроприводом',
                        link: 'p_SH'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/phocagallery/Zap-Reg-Armatura/2.png',
                        title: 'Поворотно-дисковые затворы ',
                        dsc: 'Затвор дисковый поворотный с двойным эксцентрико-длиннымплоским диском, встроенным седлом, редуктором IP67 на фланце ISO.\n' +
                        'Дизайну дисковых поворотных затворов с двойным эксцентриком характерен наклонённый закреплённый диск, обеспечивающий длительный срок службы и лёгкий технический уход.\n' +
                        'Уплотнение седла из резины EPDM, утверждённой для контакта с питьевой водой, имеет большую упругость, что позволяет ему восстанавливать свою первоначальную форму после прижатия диском. Защитное эпоксидное покрытие. Концы вала защищены от коррозии, что даёт долговечность эксплуатации. Затвор обеспечивает возможность работы в обоих направлениях потока.',
                        link: 'p_PD'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/phocagallery/Zap-Reg-Armatura/3.png',
                        title: 'Клапаны и фильтры',
                        dsc: 'ООО «Техстрой» предлагает полный ассортимент запорной арматуры для применения в трубопроводах, транспортирующих воду и газ, а также иных потребностей. Мы сотрудничаем с импортными и отечественными производителями с разным ценовым диапазоном. На территории Республики Татарстан завод «Техстрой» является официальным дилером компании AVK INTERNATIONAL A/S, расположенной в Дании, г. Гальтен, которая производит запорную арматуру, гидранты и аксессуары для водопроводов, газопроводов, систем обработки сточных вод и противопожарной защиты.\n' +
                        'В номенклатуру входят клиновые задвижки, поворотные центрические дисковые затворы и затворы с двойным эксцентриком, межфланцевые затворы, шиберные задвижки, поворотные обратные и воздушные клапаны, регулирующие клапаны «после себя», гидранты, уличные лючки, соединители, ответвительные и ремонтные хомуты, фитинги и аксессуары.\n' +
                        'Представляем широкий выбор клапанов и фильтров для водопроводных, канализационных сетей, насосных станций, технического водоснабжения.',
                        link: 'p_FK'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/phocagallery/Zap-Reg-Armatura/4.png',
                        title: 'Соединительная арматура',
                        dsc: 'Предлагаемый ассортимент соединительной арматуры широко используется в водопроводных и канализационных сетях, и промышленности. Номенклатурный ряд седелок для врезок подходит для труб из ПВХ, ПЭ, асбестоцемента, стали и чугуна всех номинальных диаметров вплоть до 1000 мм, а соединительные муфты и фланцевые адаптеры покрывают диаметры до 2200 мм.\n' +
                        'При проектировании и установке инженерного оборудования на трубопроводах использование демонтажных вставок имеет две задачи: во-первых, они незаменимы при монтаже и демонтаже оборудования, во-вторых, демонтажные вставки могут использоваться при соединении двух участков трубопроводов.',
                        link: 'p_SA'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/phocagallery/Zap-Reg-Armatura/5.png',
                        title: 'Задвижки с обрезиненным клином для газа',
                        dsc: 'Запорная арматура для газа включает в себя большой ассортимент изделий:\n' +
                        'Задвижка клиновая полнопроходная со стальными патрубками для природного газа DN 50-600 PN 16 (в том числе с электроприводом).\n' +
                        'Задвижка клиновая полнопроходная с ПЭ патрубками для природного газа DN 25-400 PN 10 (в том числе с электроприводом).\n' +
                        'Задвижка клиновая полнопроходная фланцевая для природного газа DN 40-600 PN 10/16.\n' +
                        'Кран шаровый полиэтиленовый полнопроходной DN 20-150 PN 10.\n' +
                        'Задвижка клиновая полнопроходная с внутренней резьбой малых диаметров для природного газа DN 20-50 PN 4.\n' +
                        'Дизайну клиновых задвижек AVK характерна безопасность до мельчайших деталей с полной прослеживаемостью производства их основных компонентов. Клин полностью вулканизирован резиной NBR своего собственного производства AVK, резистентной к нефтегазовой среде, состав которой имеет исключительную износостойкость благодаря способности восстанавливать свою первоначальную форму после сжатия. Эти свойства резины, процесс обрезинивания сердечника двойной адгезией слоя и прочность конструкции клина обеспечивают его долговечность.\n' +
                        'Тройная система уплотнения штока, сменная под давлением, высокая прочность штока и полная антикоррозийная защита обеспечивают непревзойдённую надёжность задвижки.',
                        link: 'p_RGZ'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/flanci/naleclogo.png',
                        title: 'Фланцы',
                        dsc: 'Фланцы стальные ГОСТ 12820-80 предназначены для герметичного соединения фрагментов трубопровода, а также присоединения трубопроводной арматуры. Преимущество фланцевого соединения заключается в широких возможностях монтажа. Любое фланцевое соединение является разъёмным, что позволяет производить своевременную замену и обслуживание запорной арматуры.\n' +
                        'Используются при прокладке временного трубопровода, укладки трубы в подтопленных, труднодоступных местах, где использование стыковых аппаратов невозможно в связи с недостаточностью пространства, а использование электросварочного аппарата связано с опасностью короткого замыкания или невозможно в связи с отсутствием электроэнергии. Для монтажа фланцев используются специальные болты.\n' +
                        'Широкий ассортимент фланцев делает их незаменимым материалом для монтажа наружных сетей. Пригодны для соединения металлических труб при помощи сварки. Для полиэтиленовых труб используются расточенные фланцы под втулку необходимого диаметра. Для увеличения срока службы используются фланцы с полипропиленовым покрытием. Фланец подбирается под давление, указанное на трубе, и применяется как на газопроводе, так и трубопроводах горячего и холодного водоснабжения.',
                        link: 's_FL'
                    }
                ],
                items5: [
                    {
                        avatar: 'http://tehstroi.ru/images/1.png',
                        title: 'Лотковые',
                        dsc: 'Завод «Техстрой» представляет полиэтиленовые колодцы, которые могут быть эффективно использованы в хозяйственно-бытовом сегменте, при обустройстве общесплавной и ливневой канализации. Вместе с тем полиэтиленовые канализационные колодцы нередко применяются для создания каналов, через которые планируется транспортировать отходы промышленного и технологического характера. Такие ПЭ-сооружения дают возможность просто и оперативно добраться к стоковым каналам и к элементам запорно-регулирующей арматуры, расположенным в системе. Применение колодцев возможно в различных сферах, что обусловлено гибкостью конструкции и возможностью использования большого количества рабочих элементов при их обустройстве.\n' +
                        'Основными преимуществами полиэтиленовых колодцев являются:\n' +
                        'абсолютная герметичность;\n' +
                        'простота в обслуживании и эксплуатации;\n' +
                        'безаварийная работа в течение длительного срока;\n' +
                        'устойчивость к процессам коррозии и различным химическим влияниям.\n' +
                        'В целом, такие конструкции обладают высокими эксплуатационными характеристиками.\n' +
                        'Лотковые полиэтиленовые колодцы\n' +
                        'Такие изделия могут быть использованы в общесплавных, ливневых и хозяйственно-бытовых канальных системах. Тип лотка может варьироваться в зависимости от числа входов и выходов.\n' +
                        'Лотки бывают следующих типов:\n' +
                        'прямопроходной – предназначен для установки на прямых участках трубопровода с периодичностью, которая определяется диаметром рабочей трубы;\n' +
                        'угловой – предназначен для участков трубопроводов, имеющих повороты и изгибы;\n' +
                        'тройниковый – предназначен для установки в местах разветвлений в системе трубопровода;\n' +
                        'крестовинный.',
                        link: 'p_LG'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/2.png',
                        title: 'Ливневый колодец (безлотковый)',
                        dsc: 'Ливневые колодцы применяются для приёма и отведения дождевых вод. Уровень функционирования ливневой системы определяется профилем поверхности и тем, насколько качественно сделана дождеприёмная система. Каждая конкретная ситуация может различаться количеством ливневых стоков, а, соответственно, различаются и профили поверхности ливневых колодцев. Колодцы для ливневой канализации выполняют ключевую функцию во всей ливневой системе, поэтому им должно быть уделено максимальное внимание на стадии формирования проекта.\n' +
                        'Чаще всего ливневая канализация, наряду с трубами и ливневыми колодцами, состоит из таких очистных конструкций, как фильтрующие патроны, масло-, бензо- и пескоотделители. На продолжительность эксплуатационного срока ливневой канализации влияет качество её исполнения, бережность в использовании, уровень защиты от загрязнения и другие факторы.',
                        link: 'p_PK'
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/4.png',
                        title: 'Резервуары для хранения питьевой воды ',
                        dsc: 'Резервуары для чистой питьевой воды (РЧВ) находят активное применение в самых различных сферах. В своей деятельности их используют строительные компании и промышленные предприятия. РЧВ могут быть задействованы в процессе прокладки шахт, бурения скважин и во время крупных экспедиций. Они жизненно необходимы в тех местах, где есть сложности с доставкой питьевой воды, но наряду с этим имеется острая необходимость в ней. Такие резервуары могут быть созданы на объектах в качестве запасного источника питьевой воды, которую используют работающие там люди.\n' +
                        'Резервуары для хранения питьевой воды могут использоваться предприятиями, занятыми в самых различных сферах. В особенной степени характерную потребность испытывают компании, связанные с добычей газа и нефти, а также горнодобывающие объекты. Чаще всего именно такие предприятия остро нуждаются в питьевой воде, систематическая доставка которой в их адрес практически невозможна. В силу ряда причин, как правило, нет возможности обустроить и соответствующие коммуникации. Именно резервуары для хранения воды становятся спасением в таких ситуациях.\n' +
                        'Наряду с газо- и нефтедобывающей промышленностью, резервуары для хранения питьевой воды широко востребованы и в нефтехимической отрасли. Здесь они функционально могут являться как основным источником, обеспечивающим потребности работающего персонала в питьевой воде, так и быть востребованными лишь в случае аварийных ситуаций. Все промышленные объекты, расположенные вдалеке от магистральных систем водоснабжения, остро нуждаются в чистой питьевой воде.',
                        link: 'p_RV'
                    }
                ]
            }
        }
    }
</script>

<style scoped>

</style>