<template>
    <v-container fluid text-xs-center>
    <v-timeline>
        <v-timeline-item
                color="orange lighten-2"
                fill-dot
                left
        >
             <span slot="opposite">
                    <v-card>
                        <v-img
                                src="https://www.openbusiness.ru/upload/iblock/877/svarochnyeraboty.jpg"
                                aspect-ratio="2.75"
                        ></v-img>
                    </v-card>
                </span>
            <v-card>
                <v-card-title class="orange lighten-2">
                    <v-icon
                            dark
                            size="42"
                            class="mr-3"
                    >
                        mdi-magnify
                    </v-icon>
                    <span
                            slot="opposite"
                            :v-text="sdfsfad"
                    ></span>
                    <h2 class="display-1 white--text font-weight-light">Сварочные бригады с оборудованием</h2>
                </v-card-title>
                <v-container>
                    <v-layout>
                        <v-flex xs10>
                            Для проведения монтажа систем водо-, газоснабжения и канализации ООО «СибТрейд» имеет несколько собственных ремонтно-строительных бригад. В их составе опытные и высококвалифицированные специалисты, которые проходят регулярное повышение квалификации и переаттестацию. Имеется возможность прокладки инженерных сетей методом ГНБ на собственном оборудовании. Предприятие является членом СРО. Все работы по строительству трубопроводов ведутся на современном высокотехнологичном оборудовании, сварка выполняется на профессиональном немецком сварочном оборудовании «Widos».                        </v-flex>
                        <v-flex xs2>
                            <v-icon size="64">mdi-calendar-text</v-icon>
                        </v-flex>
                    </v-layout>
                </v-container>
            </v-card>
        </v-timeline-item>
        <v-timeline-item
                color="amber lighten-1"
                fill-dot
                right
                small
        >
            <span slot="opposite">
                <!--<ul type="disc">-->
                    <!--<li><v-chip>небольшая масса</v-chip></li>-->
                    <!--<li><v-chip>простота при перевозке и проведении монтажных работ</v-chip></li>-->
                    <!--<li><v-chip>отсутствие возможности для образования коррозии</v-chip></li>-->
                    <!--<li><v-chip>устойчивость к воздействию агрессивных сред, бактерий, грибков и проч.</v-chip></li>-->
                    <!--<li><v-chip>доступная цена</v-chip></li>-->
                    <!--<li><v-chip>продолжительный срок эксплуатации</v-chip></li>-->
                <!--</ul>-->
                    <!--<v-list dense dark>-->
                <v-list-tile-content class="align-end"><h2 style="color:orange">Преимущества полиэтиленовых труб</h2></v-list-tile-content>
                <v-list-tile-content class="align-end"><h3>небольшая масса -</h3></v-list-tile-content>
                <v-list-tile-content class="align-end"><h3>простота при перевозке и проведении монтажных работ -</h3></v-list-tile-content>
                <v-list-tile-content class="align-end"><h3>отсутствие возможности для образования коррозии -</h3></v-list-tile-content>
                <v-list-tile-content class="align-end"><h3>устойчивость к воздействию агрессивных сред, бактерий, грибков и проч. -</h3></v-list-tile-content>
                <v-list-tile-content class="align-end"><h3>продолжительный срок эксплуатации -</h3></v-list-tile-content>

                        <!--<v-list-tile>Calories-->
                            <!--<v-list-tile-content>Calories:</v-list-tile-content>-->
                        <!--</v-list-tile>-->
                    <!--</v-list>-->
            </span>
            <v-card>
                <v-card-title class="orange lighten-2">
                    <h2 class="display-1 mr-3 white--text font-weight-light">Строительство инженерных сетей</h2>
                    <v-icon
                            dark
                            size="42"
                            class="mr-3"
                    >
                        mdi-magnify
                    </v-icon>
                </v-card-title>
                <v-container>
                    <v-layout>
                        <v-flex xs8>
                            Строительство инженерных сетей с использованием полиэтиленовых труб позволяет успешно решать проблему коррозии, которая неизбежно возникает при эксплуатации стальных трубопроводов. Продукция из ПЭ может быть использована в самых различных сферах, включая строительство магистральных трубопроводов канализации, водоснабжения и газоснабжения.

                            Полиэтиленовые трубы для водоснабжения представляет собой высокотехнологичный продукт, отличающийся от аналогичных изделий своими эксплуатационными качествами. Даже строительство магистральных промышленных трубопроводов всё чаще подразумевает использование таких труб, которые обладают следующими преимуществами:
                        </v-flex>
                    </v-layout>
                </v-container>
            </v-card>
        </v-timeline-item>
            <v-timeline-item
                    v-for="(item,index) in items"
                    :key="index"
                    large
            >
                <v-avatar slot="icon">
                    <img :src="item.src">
                </v-avatar>
                <span slot="opposite">
                  <v-card-text v-if="item.oposit_text" v-html="item.oposit_text">
                  </v-card-text>
                    <v-card v-else>
                        <v-img
                                :src="item.src"
                                aspect-ratio="2.75"
                        ></v-img>
                    </v-card>
                </span>
                <v-card class="elevation-2">
                    <v-card-title class="headline">{{item.title}}</v-card-title>
                    <v-card-text>
                        {{item.dsc}}
                    </v-card-text>
                </v-card>
            </v-timeline-item>
        </v-timeline>
    </v-container>
</template>

<script>
    export default {
        name: "Provider",
        data: () => ({
            items: [
                {
                    title: 'Прокладка магистральных трубопроводов',
                    dsc: 'Компания «СибТрейд» занимается не только эксклюзивной продажей полиэтиленовой продукции, но и предоставляет широкий перечень услуг. Например – подземная бестраншейная прокладка магистральных трубопроводов для водоснабжения. Мы также проводим ремонтные и реконструкционные работы, связанные с полиэтиленовыми трубопроводами, транспортирующими жидкости, газ, нефтепродукты, а также являющимися частью дренажных систем и канализации. Строительство вкупе с комплектацией инженерных сетей и коммуникаций во всех регионах России является одним из перспективных направлений деятельности нашей компании.\n' +
                    '\n' +
                    'Чтобы узнать стоимость строительства трубопровода, обратитесь к нам: наши высококвалифицированные работники предоставят консультацию по интересующему вас вопросу, а профильные специалисты качественно выполнят различные виды работ на вашем трубопроводе.',
                    src: location.protocol + "//" + location.host + '/static/img/MT.jpg',
                    oposit_text: '' +
                    '                <h2 style="color:orange">Наши основные ориентиры </h2>' +
                    '                <ul><li><h3>качество</h3></li>\n' +
                    '                <li><h3>оперативность</h3></li>\n' +
                    '                <li><h3>профессионализм</h3></li>\n'
                },
                {
                    title: 'Монтаж газопровода',
                    dsc: 'Строительство трубопровода для газоснабжения (газопровода) – процесс, предполагающий ответственный подход, и учитывающий соблюдение ряда весомых факторов. Ключевым из них является качество трубы и сопутствующих элементов, которые станут залогом долговременного и безопасного функционирования газопроводной системы.\n' +
                    '\n' +
                    'Компания «СибТрейд» представляет большой ассортимент полиэтиленовых труб, которые могут быть использованы во время выполнения монтажных и ремонтных работ на магистральных газопроводах. Мы занимаемся продажей полиэтиленовых труб для газа марки ПЭ-100, соответствующих ГОСТу 50838-95. Наша продукция отличается высоким качеством и доступными ценами. С нашей помощью вы сможете выполнить любые работы по строительству газопровода безопасно и максимально качественно.',
                    src: location.protocol + "//" + location.host + '/static/img/MG.jpg',
                    oposit_text:''
                },
                {
                    title: 'Монтаж водопровода',
                    dsc: 'Современные решения для организации строительства магистральных трубопроводов для водоснабжения предполагают использование полиэтиленовых труб, производимых из полиэтилена марок ПЭ-80 и ПЭ-100 по ГОСТу 18599-2001.\n' +
                    '\n' +
                    'Трубопроводы, смонтированные из полиэтиленовых труб, имеют отличные эксплуатационные параметры, в частности, они высокоэкологичны и имеют высокую пропускную способность. Кроме того, обустройство такого трубопровода не предполагает расходов, связанных с дополнительной изоляцией труб.\n' +
                    '\n' +
                    'Компания «СибТрейд» обеспечивает своим клиентам выгодные условия на поставку труб ПЭ для строительства магистральных трубопроводов.',
                    src: location.protocol + "//" + location.host + '/static/img/MV.jpg',
                    oposit_text:'<h2 style="color:orange">На нашем сайте в специальном каталоге представлен весь перечень предлагаемой продукции.</h2>'
                },
                {
                    title: 'Наличие спецтехники',
                    dsc: 'Наш завод имеет собственное строительное подразделение и более 300 единиц спецтехники, необходимой для решения строительных задач.\n' +
                    'Допуск СРО-С-020-22072009 по строительству «Объединение генеральных подрядчиков в строительстве»',
                    src: location.protocol + "//" + location.host + '/static/img/ST.jpg'
                },
                {
                    title: 'Изготовления изделий нестандартных по эскизу заказчика',
                    dsc: 'При изготовлении сложных фасонных изделий и деталей мы ориентируемся на индивидуальные потребности заказчика. Мы реализуем сложные проекты с использованием полиэтилена марки ПЭ100 и полипропилена марки PB. Одними из основных изделий производим фитинги сложной конфигурации и офланцованные отрезки трубопроводов. Одним из активно развивающихся направлений деятельности нашей компании является изготовление металлоконструкций по эскизу заказчика.',
                    src: location.protocol + "//" + location.host + '/static/img/ZZ.jpg'
                }
            ]
        })
    }
</script>

<style scoped>

</style>