<template>
        <v-expansion-panel focusable>
            <v-expansion-panel-content
                    v-for="(item,i) in items"
                    :key="i"
            >
                <div slot="header">{{item.header}}</div>
                <v-card>
                    <v-card-text>{{item.content}}</v-card-text>
                </v-card>
            </v-expansion-panel-content>
        </v-expansion-panel>
</template>

<script>
    export default {
        name: "Texts",
        data: () => ({
            length: 3,
            window: 0,
            items : [
                {
                    header : "Производство полиэтиленовых труб – завод «Техстрой»",
                    content : "Завод «Техстрой» - крупный производитель полиэтиленовых труб, занимающий вторую строчку всероссийского рейтинга по объёму выпускаемой продукции. По уровню оборудования и технической оснащённости, согласно оценкам зарубежных экспертов, наше предприятие является лидером отрасли в РФ.\n" +
                    "\n" +
                    "Наш завод полиэтиленовых труб принимает заказы на оптовые поставки по всей России. Звоните нам, чтобы купить ПНД трубу от завода-изготовителя по выгодной цене."
                },
                {
                    header : "Производитель полиэтиленовых труб: 18 лет успешной работы",
                    content : "Мы производим ПЭ трубы уже более 18 лет и занимаем 20% рынка трубной продукции. На сегодняшний день объёмы выпуска готовых изделий нашего предприятия достигают 60 тысяч тонн ежегодно.\n" +
                    "\n" +
                    "Производство продукции осуществляется одновременно на 4 заводах, где задействовано 20 технологических линий высокой производительности.\n" +
                    "\n"
                },
                {
                    header : "Завод по производству ПЭ труб: контроль качества на каждом этапе",
                    content : "Завод «Техстрой» – это надёжный завод-изготовитель полиэтиленовых труб, купить которые вы можете по выгодной цене.\n" +
                    "\n" +
                    "Предприятие сертифицировано по ИСО 9001, вся продукция обладает сертификатами соответствия и безопасности.\n" +
                    "\n" +
                    "Производство изделий постоянно контролируется специальной службой качественного контроля, которая выявляет и ликвидирует нарушения технологического процесса, осуществляет постоянный контроль качества сырья.\n" +
                    "\n" +
                    "Продукция проходит обязательную проверку в аттестованной лаборатории на современном технологическом и испытательном оборудовании. Каждая партия проверяется на прочность, поведение при разрыве и другие показатели."
                },
                {
                    header : "Производство ПЭ труб на передовом немецком оборудовании\n",
                    content : "Производство ПЭ труб осуществляется на самом современном оборудовании знаменитого бренда «Баттенфельд Цинцинатти». Все технологические линии обладают высоким уровнем автоматизации, за счёт чего изготовление продукции проходит с наивысшей точностью, без погрешностей и ошибок, присущих человеческому фактору.\n" +
                    "\n" +
                    "Заграничные эксперты оценили производственный комплекс компании «Техстрой» как один из самых современных в Европе и лучший в России.\n" +
                    "\n"
                },
                {
                    header : "Завод производства полиэтиленовых труб большого диаметра",
                    content : "Завод «Техстрой» первым среди предприятий Российской Федерации наладило изготовление полиэтиленовых труб большого сечения (до 1600 мм). Это открыло широкие возможности для заказчиков в плане реализации экономически выгодных решений при создании трубопроводных систем.\n" +
                    "\n" +
                    "Также компания осуществляет производство продукции малых и стандартных размеров (от 32 мм).\n" +
                    "\n"
                },
                {
                    header : "Продукция «СибТрейд» – гарантия надёжности трубопровода",
                    content : "Изготовление трубопроводов из полиэтилена с применением изделий компании «СибТрейд» является гарантией высокой прочности, герметичности и надёжности трубопроводной системы. При соблюдении условий монтажа и эксплуатации подобные трубопроводы будут эффективно функционировать без необходимости проведения ремонтных работ до 50 лет.\n" +
                    "\n" +
                    "Мы предлагаем купить ПЭ (полиэтиленовые) трубы от завода-производителя на наиболее выгодных условиях поставки. Звоните, и вы останетесь довольны сотрудничеством!\n" +
                    "\n"
                }
                ]
        })
    }
</script>

<style scoped>

</style>